In [1]:
import pandas as pd
import numpy as np

In [2]:
s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [4]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [7]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=['A','B','C','D'])
df

                   A         B         C         D
2013-01-01 -1.064623  0.910988  1.007891  0.009567
2013-01-02  0.608955  1.474904 -0.388300  0.988927
2013-01-03  0.194872 -2.961107  1.189225  0.822613
2013-01-04 -1.944368 -1.257615 -0.118828  0.766183
2013-01-05  0.240815  1.892428  1.254921  0.211214
2013-01-06  2.008689  0.786274 -0.052514 -2.701553

In [8]:
df.head(3)

                   A         B         C         D
2013-01-01 -1.064623  0.910988  1.007891  0.009567
2013-01-02  0.608955  1.474904 -0.388300  0.988927
2013-01-03  0.194872 -2.961107  1.189225  0.822613

In [9]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [10]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [11]:
df.values

array([[-1.0646234 ,  0.91098788,  1.00789101,  0.00956671],
       [ 0.60895548,  1.4749036 , -0.38829959,  0.9889271 ],
       [ 0.19487227, -2.96110659,  1.18922493,  0.82261309],
       [-1.94436781, -1.25761533, -0.1188278 ,  0.76618316],
       [ 0.24081502,  1.89242814,  1.25492104,  0.21121446],
       [ 2.00868895,  0.78627373, -0.05251416, -2.70155272]])

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2013-01-01 to 2013-01-06
Freq: D
Data columns (total 4 columns):
A    6 non-null float64
B    6 non-null float64
C    6 non-null float64
D    6 non-null float64
dtypes: float64(4)
memory usage: 240.0 bytes

In [13]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.007390  0.140979  0.482066  0.016159
std    1.372245  1.867364  0.745420  1.384430
min   -1.944368 -2.961107 -0.388300 -2.701553
25%   -0.749749 -0.746643 -0.102249  0.059979
50%    0.217844  0.848631  0.477688  0.488699
75%    0.516920  1.333925  1.143891  0.808506
max    2.008689  1.892428  1.254921  0.988927

In [14]:
df.sort_values(by="B", ascending=False)

                   A         B         C         D
2013-01-05  0.240815  1.892428  1.254921  0.211214
2013-01-02  0.608955  1.474904 -0.388300  0.988927
2013-01-01 -1.064623  0.910988  1.007891  0.009567
2013-01-06  2.008689  0.786274 -0.052514 -2.701553
2013-01-04 -1.944368 -1.257615 -0.118828  0.766183
2013-01-03  0.194872 -2.961107  1.189225  0.822613

In [15]:
df

                   A         B         C         D
2013-01-01 -1.064623  0.910988  1.007891  0.009567
2013-01-02  0.608955  1.474904 -0.388300  0.988927
2013-01-03  0.194872 -2.961107  1.189225  0.822613
2013-01-04 -1.944368 -1.257615 -0.118828  0.766183
2013-01-05  0.240815  1.892428  1.254921  0.211214
2013-01-06  2.008689  0.786274 -0.052514 -2.701553

In [16]:
df["A"]

2013-01-01   -1.064623
2013-01-02    0.608955
2013-01-03    0.194872
2013-01-04   -1.944368
2013-01-05    0.240815
2013-01-06    2.008689
Freq: D, Name: A, dtype: float64

In [17]:
df.columns[0]

'A'

In [18]:
df[0:3]

                   A         B         C         D
2013-01-01 -1.064623  0.910988  1.007891  0.009567
2013-01-02  0.608955  1.474904 -0.388300  0.988927
2013-01-03  0.194872 -2.961107  1.189225  0.822613

In [20]:
df.loc[dates[0]]

A   -1.064623
B    0.910988
C    1.007891
D    0.009567
Name: 2013-01-01 00:00:00, dtype: float64

In [24]:
df.loc[:,['A','B']]

                   A         B
2013-01-01 -1.064623  0.910988
2013-01-02  0.608955  1.474904
2013-01-03  0.194872 -2.961107
2013-01-04 -1.944368 -1.257615
2013-01-05  0.240815  1.892428
2013-01-06  2.008689  0.786274

In [25]:
df.iloc[3]

A   -1.944368
B   -1.257615
C   -0.118828
D    0.766183
Name: 2013-01-04 00:00:00, dtype: float64

In [26]:
df

                   A         B         C         D
2013-01-01 -1.064623  0.910988  1.007891  0.009567
2013-01-02  0.608955  1.474904 -0.388300  0.988927
2013-01-03  0.194872 -2.961107  1.189225  0.822613
2013-01-04 -1.944368 -1.257615 -0.118828  0.766183
2013-01-05  0.240815  1.892428  1.254921  0.211214
2013-01-06  2.008689  0.786274 -0.052514 -2.701553

In [27]:
df["A"]

2013-01-01   -1.064623
2013-01-02    0.608955
2013-01-03    0.194872
2013-01-04   -1.944368
2013-01-05    0.240815
2013-01-06    2.008689
Freq: D, Name: A, dtype: float64

In [28]:
df.A

2013-01-01   -1.064623
2013-01-02    0.608955
2013-01-03    0.194872
2013-01-04   -1.944368
2013-01-05    0.240815
2013-01-06    2.008689
Freq: D, Name: A, dtype: float64

In [29]:
df[df.A> 0]

                   A         B         C         D
2013-01-02  0.608955  1.474904 -0.388300  0.988927
2013-01-03  0.194872 -2.961107  1.189225  0.822613
2013-01-05  0.240815  1.892428  1.254921  0.211214
2013-01-06  2.008689  0.786274 -0.052514 -2.701553

In [30]:
df[df>0]

                   A         B         C         D
2013-01-01       NaN  0.910988  1.007891  0.009567
2013-01-02  0.608955  1.474904       NaN  0.988927
2013-01-03  0.194872       NaN  1.189225  0.822613
2013-01-04       NaN       NaN       NaN  0.766183
2013-01-05  0.240815  1.892428  1.254921  0.211214
2013-01-06  2.008689  0.786274       NaN       NaN

In [31]:
df2 = df.copy()

In [32]:
df2

                   A         B         C         D
2013-01-01 -1.064623  0.910988  1.007891  0.009567
2013-01-02  0.608955  1.474904 -0.388300  0.988927
2013-01-03  0.194872 -2.961107  1.189225  0.822613
2013-01-04 -1.944368 -1.257615 -0.118828  0.766183
2013-01-05  0.240815  1.892428  1.254921  0.211214
2013-01-06  2.008689  0.786274 -0.052514 -2.701553

In [33]:
df2['E'] = ['one','one','two','three','four','three']
df2

                   A         B         C         D      E
2013-01-01 -1.064623  0.910988  1.007891  0.009567    one
2013-01-02  0.608955  1.474904 -0.388300  0.988927    one
2013-01-03  0.194872 -2.961107  1.189225  0.822613    two
2013-01-04 -1.944368 -1.257615 -0.118828  0.766183  three
2013-01-05  0.240815  1.892428  1.254921  0.211214   four
2013-01-06  2.008689  0.786274 -0.052514 -2.701553  three

In [34]:
df2['E'].isin(['two','four'])

2013-01-01    False
2013-01-02    False
2013-01-03     True
2013-01-04    False
2013-01-05     True
2013-01-06    False
Freq: D, Name: E, dtype: bool

In [35]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03  0.194872 -2.961107  1.189225  0.822613   two
2013-01-05  0.240815  1.892428  1.254921  0.211214  four

In [36]:
df

                   A         B         C         D
2013-01-01 -1.064623  0.910988  1.007891  0.009567
2013-01-02  0.608955  1.474904 -0.388300  0.988927
2013-01-03  0.194872 -2.961107  1.189225  0.822613
2013-01-04 -1.944368 -1.257615 -0.118828  0.766183
2013-01-05  0.240815  1.892428  1.254921  0.211214
2013-01-06  2.008689  0.786274 -0.052514 -2.701553

In [41]:
df.apply(np.cumsum)

                   A         B         C         D
2013-01-01 -1.064623  0.910988  1.007891  0.009567
2013-01-02 -0.455668  2.385891  0.619591  0.998494
2013-01-03 -0.260796 -0.575215  1.808816  1.821107
2013-01-04 -2.205163 -1.832830  1.689989  2.587290
2013-01-05 -1.964348  0.059598  2.944910  2.798505
2013-01-06  0.044341  0.845871  2.892395  0.096952

In [42]:
df.apply(lambda x: x.max() - x.min())

A    3.953057
B    4.853535
C    1.643221
D    3.690480
dtype: float64